Examinator/src/Enums/ТемыВебКабинетаСУ/ТемыВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТемыВебКабинетаСУ</name>
  <enumValues>
    <name>Облако</name>
  </enumValues>
  <enumValues>
    <name>Пляж</name>
  </enumValues>
  <enumValues>
    <name>Аквамарин</name>
  </enumValues>
  <enumValues>
    <name>Лето</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТемыВебКабинетаСУ/ManagerModule.bsl
Функция КодТемы(Тема) Экспорт
	
	Если Тема = Перечисления.ТемыВебКабинетаСУ.Облако Тогда
		Возврат "cloud";
	КонецЕсли;
	
	Если Тема = Перечисления.ТемыВебКабинетаСУ.Пляж Тогда
		Возврат "beach";
	КонецЕсли;
	
	Если Тема = Перечисления.ТемыВебКабинетаСУ.Аквамарин Тогда
		Возврат "aquamarine";
	КонецЕсли;
	
	Если Тема = Перечисления.ТемыВебКабинетаСУ.Лето Тогда
		Возврат "summer";
	КонецЕсли;	
	
	Возврат "cloud";
	
КонецФункции
